Repository: nikolastanin/key2pay
Catalog: languages/key2pay-*.po
Languages: ja, sr_rs

source: Key2Pay Secure Redirect
ja: Key2Pay セキュアリダイレクト
sr_rs: Key2Pay Sigurno Preusmeravanje

source: Accept payments via Key2Pay with maximum security. Customers are redirected to Key2Pay's hosted payment page.
ja: Key2Payを使用して最大限のセキュリティで支払いを受け付けます。お客様はKey2Payのホストされた支払いページにリダイレクトされます。
sr_rs: Prihvatite plaćanja putem Key2Pay-a uz maksimalnu sigurnost. Kupci se preusmeravaju na Key2Pay-ovu stranicu za plaćanje.

source: Pay securely using Key2Pay. You will be redirected to complete your payment securely.
ja: Key2Payを使用して安全に支払いを行ってください。支払いを完了するために安全なページにリダイレクトされます。
sr_rs: Platite sigurno koristeći Key2Pay. Bićete preusmereni da sigurno završite vaše plaćanje.

source: Enable/Disable
ja: 有効/無効
sr_rs: Omogući/Onemogući

source: Enable Key2Pay Secure Redirect
ja: Key2Payセキュアリダイレクトを有効にする
sr_rs: Omogući Key2Pay Sigurno Preusmeravanje

source: Title
ja: タイトル
sr_rs: Naslov

source: This controls the title which the user sees during checkout.
ja: チェックアウト時にユーザーが表示するタイトルを制御します。
sr_rs: Ovo kontroliše naslov koji korisnik vidi tokom naplate.

source: Description
ja: 説明
sr_rs: Opis

source: This controls the description which the user sees during checkout.
ja: チェックアウト時にユーザーが表示する説明を制御します。
sr_rs: Ovo kontroliše opis koji korisnik vidi tokom naplate.

source: Authentication Settings
ja: 認証設定
sr_rs: Podešavanja Autentifikacije

source: Configure how to authenticate with Key2Pay API.
ja: Key2Pay APIとの認証方法を設定します。
sr_rs: Konfigurišite kako da se autentifikujete sa Key2Pay API-jem.

source: Authentication Method
ja: 認証方法
sr_rs: Metod Autentifikacije

source: Choose the authentication method for Key2Pay API.
ja: Key2Pay APIの認証方法を選択してください。
sr_rs: Izaberite metod autentifikacije za Key2Pay API.

source: Basic (Merchant ID + Password)
ja: 基本（マーチャントID + パスワード）
sr_rs: Osnovni (ID Trgovca + Lozinka)

source: API Key
ja: APIキー
sr_rs: API Ključ

source: Bearer Token
ja: ベアラートークン

source: HMAC Signed
ja: HMAC署名
sr_rs: HMAC Potpisan

source: Merchant ID
ja: マーチャントID
sr_rs: ID Trgovca

source: Your Key2Pay Merchant ID (required for Basic authentication).
ja: Key2PayマーチャントID（基本認証に必要）。
sr_rs: Vaš Key2Pay ID Trgovca (potreban za osnovnu autentifikaciju).

source: Password
ja: パスワード
sr_rs: Lozinka

source: Your Key2Pay API Password (required for Basic authentication).
ja: Key2Pay APIパスワード（基本認証に必要）。
sr_rs: Vaša Key2Pay API lozinka (potrebna za osnovnu autentifikaciju).

source: Your Key2Pay API Key (required for API Key and HMAC authentication).
ja: Key2Pay APIキー（APIキー認証とHMAC認証に必要）。
sr_rs: Vaš Key2Pay API ključ (potreban za API ključ i HMAC autentifikaciju).

source: Secret Key
ja: シークレットキー
sr_rs: Tajni Ključ

source: Your Key2Pay Secret Key (required for HMAC authentication and webhook verification).
ja: Key2Payシークレットキー（HMAC認証とwebhook検証に必要）。
sr_rs: Vaš Key2Pay tajni ključ (potreban za HMAC autentifikaciju i webhook verifikaciju).

source: Access Token
ja: アクセストークン
sr_rs: Token za Pristup

source: Your Key2Pay Access Token (required for Bearer authentication).
ja: Key2Payアクセストークン（ベアラー認証に必要）。
sr_rs: Vaš Key2Pay token za pristup (potreban za Bearer autentifikaciju).

source: Debug Log
ja: デバッグログ

source: Enable logging
ja: ログを有効にする
sr_rs: Omogući logovanje

source: Log Key2Pay redirect events.
ja: Key2Payリダイレクトイベントをログに記録します。
sr_rs: Loguj Key2Pay preusmeravanje događaje.

source: Payment approved successfully.
ja: 支払いが正常に承認されました。
sr_rs: Plaćanje uspešno odobreno.

source: Payment failed: Insufficient funds in the account.
ja: 支払い失敗：口座残高不足。
sr_rs: Plaćanje neuspešno: Nedovoljno sredstava na računu.

source: Payment failed: Do not honour - the transaction was declined by the bank.
ja: 支払い失敗：不承認 - 銀行によって取引が拒否されました。
sr_rs: Plaćanje neuspešno: Ne poštuj - transakcija je odbijena od strane banke.

source: Payment failed: Restricted card - this card cannot be used for this transaction.
ja: 支払い失敗：制限されたカード - このカードはこの取引に使用できません。
sr_rs: Plaćanje neuspešno: Ograničena kartica - ova kartica se ne može koristiti za ovu transakciju.

source: Payment failed: Invalid transaction - the transaction details are not valid.
ja: 支払い失敗：無効な取引 - 取引詳細が無効です。
sr_rs: Plaćanje neuspešno: Nevažeća transakcija - detalji transakcije nisu validni.

source: Payment failed: Transaction timeout - the request took too long to process.
ja: 支払い失敗：取引タイムアウト - リクエストの処理に時間がかかりすぎました。
sr_rs: Plaćanje neuspešno: Istek vremena transakcije - zahtev je predugo trajao za obradu.

source: Payment processed with unknown response code.
ja: 不明な応答コードで支払いが処理されました。
sr_rs: Plaćanje obrađeno sa nepoznatim kodom odgovora.

source: Your payment has been approved successfully!
ja: お支払いが正常に承認されました！
sr_rs: Vaše plaćanje je uspešno odobreno!

source: Sorry, your payment could not be processed due to insufficient funds. Please check your account balance and try again.
ja: 申し訳ございませんが、残高不足のためお支払いを処理できませんでした。口座残高をご確認の上、再度お試しください。
sr_rs: Žao nam je, vaše plaćanje nije moglo biti obrađeno zbog nedovoljno sredstava. Molimo proverite stanje vašeg računa i pokušajte ponovo.

source: Sorry, your payment was declined by your bank. Please contact your bank or try a different payment method.
ja: 申し訳ございませんが、お支払いが銀行によって拒否されました。銀行にお問い合わせいただくか、別の支払い方法をお試しください。
sr_rs: Žao nam je, vaše plaćanje je odbila vaša banka. Molimo kontaktirajte vašu banku ili pokušajte drugi način plaćanja.

source: Sorry, this card cannot be used for this transaction. Please try a different card or contact your bank.
ja: 申し訳ございませんが、このカードはこの取引に使用できません。別のカードをお試しいただくか、銀行にお問い合わせください。
sr_rs: Žao nam je, ova kartica se ne može koristiti za ovu transakciju. Molimo pokušajte drugu karticu ili kontaktirajte vašu banku.

source: Sorry, there was an issue with the transaction details. Please check your information and try again.
ja: 申し訳ございませんが、取引詳細に問題がありました。情報をご確認の上、再度お試しください。
sr_rs: Žao nam je, došlo je do problema sa detaljima transakcije. Molimo proverite vaše informacije i pokušajte ponovo.

source: Sorry, the payment request timed out. Please try again or contact support if the problem persists.
ja: 申し訳ございませんが、支払いリクエストがタイムアウトしました。再度お試しいただくか、問題が続く場合はサポートにお問い合わせください。
sr_rs: Žao nam je, zahtev za plaćanje je istekao. Molimo pokušajte ponovo ili kontaktirajte podršku ako se problem nastavi.

source: Sorry, there was an unexpected issue with your payment. Please try again or contact support.
ja: 申し訳ございませんが、お支払いで予期しない問題が発生しました。再度お試しいただくか、サポートにお問い合わせください。
sr_rs: Žao nam je, došlo je do neočekivanog problema sa vašim plaćanjem. Molimo pokušajte ponovo ili kontaktirajte podršku.

source: Your credit card payment was not successful. Please try again or contact support if you believe this is an error.
ja: クレジットカードでのお支払いが成功しませんでした。再度お試しいただくか、エラーだと思われる場合はサポートにお問い合わせください。
sr_rs: Vaše plaćanje kreditnom karticom nije bilo uspešno. Molimo pokušajte ponovo ili kontaktirajte podršku ako smatrate da je ovo greška.
